Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 叶漓无奈的摇了摇头：“那时候我自卑，觉得你们太优秀了，觉得我被爆出来，肯定会被人家嘲笑，我怕会连累你们，所以才不喜欢，但是我现在长大了，有你们这么优秀的哥哥，我开心都来不及呢，才不怕。”
en_us: Ye Li shook her head helplessly, "I used to have an inferiority complex then. I thought that you guys are too outstanding and that I'd definitely be mocked at after my identity was exposed. I was afraid of implicating you guys. However, I'm grown up now and I'm more than happy to have such outstanding brothers like you guys. I'm not scared at all."

source: 叶漓无所谓的撇了撇嘴，抬脚走出了教室。
en_us: Ye Li pursed her lips nonchalantly and walked out of the classroom.

source: 叶漓无视众人惊愕的目光，掏出了自己的书本，一副准备认真上课的模样。
en_us: Ye Li ignored the looks of amazement from the crowd and took out her books, looking like she was ready to pay attention in class.

source: 叶漓早上没有吃营养餐，身体没有了能量消耗，她站了一会就感觉肚子咕咕叫了。
en_us: Since Ye Li skipped the nutritious breakfast, she had run out of energy and her stomach began to rumble after she stood for a while.

source: 叶漓是从哪里知道这件事的。
en_us: How did Ye Li know about this?

source: 叶漓是用原相机拍摄的。
en_us: Ye Li took the photo without any digital photo enhancement software.

source: 叶漓有些莫名的看着对方阴沉的表情，突然手一紧，她收回了目光，就对上了徐凤年有些不悦的眼神。
en_us: Looking at his austere and gloomy expression, Ye Li was somewhat puzzled. She suddenly clenched her fists and looked away, only to meet Xu Fengnian's unhappy gaze.

source: 叶漓本来是知道大哥会来的，因为上一世她记得他也来了，只是没想到，二哥三哥都跟着。
en_us: Ye Li knew that her elder brother would be attending the gathering because she remembered that he was present in his previous life too. However, she did not expect her other two brothers to tag along too.

source: 叶漓本来还没怎么放心上，可听到程艳那一句没教养时，瞳孔瞬间一冷，如刀锋一样的目光划过对方，唇角轻启，“老师，说我就说我，上升到我父母是不是有点过分了？你这样说别人，就很有教养了?”
en_us: Ye Li didn't take it to heart at first but when she heard Cheng Yan calling her uncultured, her gaze immediately turned cold and she glared daggers at Cheng Yan. "Teacher, go ahead and criticize me all you want but you're going overboard by getting my parents involved. Are you very cultured? You're making such comments about others."

source: 叶漓本来还没觉得有什么的，可看到哥哥这么担忧的表情，心里一下就委屈了，扁着嘴点头，“他们说我跟你出去吃饭有罪，要开除我！”
en_us: Ye Li did not think much of it at the moment but when he saw the look of worry on her brother's face, she immediately felt aggrieved. Pursing her lips, she nodded and said, "They said that it's wrong for me to have lunch with you and they want to expel me because of it!"

source: 叶漓歪了歪头看她：“你都敢，我为什么不敢？”
en_us: Tilting her head to look at her, she asked, "Since you dare to do it, why wouldn't I dare?"

source: 叶漓歪头躲开，抬脚朝着对方小腹踢了过去。
en_us: Ye Li tilted her head to dodge before raising her leg to kick the girl in her stomach.

source: 叶漓永远也忘不了，这个女人为了财产，竟然找人对她下手以此威胁徐凤年交出继承权的场景！
en_us: Ye Li would never forget that Xu Yuan hired someone to harm her and threaten Xu Fengnian into handing over his inheritance!

source: 叶漓没有回复任何人，而是直接在评论区@了ys的官方微博号，并问了一句“限量款却被两个人同时穿上，官方如何看？”
en_us: Ye Li did not reply to anyone and instead mentioned the official Twitter account of the luxury fashion label, YS Fashion in her reply. "The limited edition dress was donned by two people at once. What do you guys think?"

source: 叶漓点了点头：“三哥哥，不信你可以去问他，在你面前他不会那样，但是私底下对我的态度有多恶劣你不会知道，一瞬间，我感觉什么尊严都没了。”
en_us: Ye Li nodded and said, "Third Brother, if you don't believe me, you can ask him. He may not behave that way in front of you but you'll never know how hostile he is to me in private. I suddenly felt that I lost all my pride and dignity."

source: 叶漓狠狠的掐了自己大腿一下，剧烈的刺痛却让她莫名的欣喜若狂。
en_us: Ye Li pinched her thigh forcefully and the sharp, excruciating pain made her feel somewhat ecstatic and elated.

source: 叶漓猛不然就被电了一下，手也不动了吗，模样乖得很。
en_us: Ye Li abruptly stopped, feeling like she had been electrified. She looked extremely obedient.

source: 叶漓猛地抬头看去，就对上了男人深沉的双眼。
en_us: Ye Li abruptly raised her head to meet his gloomy gaze.

source: 叶漓百无聊赖的上着课，就收到了三哥哥发的微信。
en_us: Ye Li was listening to the lesson in boredom when she received a text message from her brother.

source: 叶漓的三哥叫做叶枫，这会儿还穿着帝都大学的校服，他染着一头蓝发，整个人看起来吊儿郎当的，可却是如今帝都大学的校草兼学霸，娱乐圈的当红一线大明星，全国女人心尖上的男神！可他依然还是一个妹控！
en_us: Ye Li's third brother was named Ye Feng. He was still wearing the uniform of Beijing University and he had a head full of blue hair. He seemed nonchalant and sloven but he was the most handsome boy in school and the star student of Beijing University. He was also a famous A-list celebrity in the showbiz industry, and the idol of all women in the nation! Yet, he was also particularly indulgent towards his younger sister!

source: 叶漓的唇角微微一勾。
en_us: Ye Li smirked a little.

source: 叶漓的嘴角上扬，笑容却有些邪恶，“当然是以其人之道还治其人之身，孟先生还记得你刚刚是怎样要惩罚我的？”
en_us: An evil smile graced Ye Li's face and she said, "Of course you'd have to let me pay you back in your own coin. Mr. Meng, (Meng Fei's father), do you still remember how you wanted to punish me just now?"

source: 叶漓的声音却蓦然一冷：“脸大就不能见人了？非要藏着掖着？”
en_us: Ye Li retorted with a sudden hostility in her tone, "What's wrong with having a large face? Must I hide it?"

source: 叶漓的心一疼。
en_us: Ye Li's heart ached.

source: 叶漓的性格虽然不好，经常得罪人，但是大多时候都是恼羞成怒的生气，什么时候这么会说话了？
en_us: Although Ye Li did not have a good temper and often offended others, it was mostly because she was infuriated after feeling ashamed. Since when had she ever been so sharp-tongued?

source: 叶漓的样子不似作假。
en_us: He felt that Ye Li didn't seem to be lying.

source: 叶漓的母亲是名门之后，叫做秦歌，父亲是大世家的少爷，叫叶明，两人青梅竹马，门当户对，几乎是所有人都艳羡的存在。
en_us: Ye Li's mother, Qin Ge, was from a wealthy and famous family while her father, Ye Ming, was the Young Master of a major family. The two of them were childhood sweethearts, and their families were a perfect match. They were a couple who left almost everyone green with envy.

source: 叶漓的热度才逐渐慢慢散了下去。
en_us: Ye Li gradually became less viral.

source: 叶漓的眼中闪过一抹冰寒，嘴角的笑容逐渐变得讥讽。
en_us: An icy cold gaze formed in Ye Li's eyes and the smile on her lips gradually became contemptuous.

source: 叶漓的瞳孔中染上意一丝血色。
en_us: There was a tinge of blood in Ye Li's eyes.

source: 叶漓的瞳孔越来越深，眼尾带了几分红：“你别太过分了。”
en_us: Ye Li's pupils grew even deeper and the corners of her eyes were red. "Don't go overboard."

source: 叶漓的耳朵一瞬间有些发麻。
en_us: Ye Li's ears turned a little numb all of a sudden.

source: 叶漓的脸一下就沉了下来。
en_us: Ye Li's face turned sullen immediately.

source: 叶漓的表情几乎都没变化。
en_us: There were almost no changes in Ye Li's expression.

source: 叶漓的转变实在太奇怪了。
en_us: Ye Li's changes were too peculiar.

source: 叶漓的骨架很小，所以就算是瘦了，给人的感觉也是肉乎乎的。
en_us: Ye Li was very petite and had a small frame. Hence, even though she had lost weight, she still seemed chubby.

source: 叶漓皱眉看她，“有事？”
en_us: Looking at her with a frown, Ye Li asked, "What's the matter?"

source: 叶漓看了一下，就无趣的关了。
en_us: Ye Li switched it off after getting bored of reading the comments.

source: 叶漓看到他们，心里就有种难以言喻的愧疚和悲伤。
en_us: When Ye Li saw them, she was filled with an inexplicable guilt and melancholy.

source: 叶漓看向三位有几分相似却同样帅气俊美的哥哥。
en_us: Ye Li looked at her three brothers who somewhat resembled each other but were equally handsome and suave.

source: 叶漓看向二夫人，表情漠然道。
en_us: Ye Li looked at Mrs. Xu with an indifferent expression.

source: 叶漓看清楚对方脸的瞬间，眼中的笑容也淡了两分。
en_us: Ye Li's smile faded when she saw the woman's face.

source: 叶漓看着叶眉难看的脸，嘴角的笑容越发扩大。
en_us: Ye Li grinned even wider when she saw how upset Ye Mei was.

source: 叶漓看着哥哥兴奋的表情，心里一阵温暖。
en_us: Looking at her brother's excited expression, Ye Li felt a warm and fuzzy feeling in her heart.

source: 叶漓看着她欢快的背影，笑了：“希望你付款的时候还能笑得这么开心。”
en_us: Staring at Ye Mei's back while the latter left joyously, Ye Li smiled and muttered, "I hope you'd still be able to smile so happily when you're at the cashier."

source: 叶漓看着她脸上几乎要掩饰不住的扭曲，心里暗暗冷笑。
en_us: Ye Li watched as Ye Li's face grimaced uncontrollably, and secretly sneered in her head.

source: 叶漓看着她这虚伪的嘴脸，就一阵不适，忍住了一巴掌打过去的冲动，她扯了扯嘴角皮笑肉不笑的说：“有事？”
en_us: Looking at her hypocritical and pretentious face, Ye Li immediately felt revolted. Resisting the urge to give her a tight slap, Ye Li put on a fake smile and asked, "Is there something wrong?"

source: 叶漓看着徐夫人，总觉得有些伤感。
en_us: Ye Li looked at Mrs. Xu with some melancholy.

source: 叶漓看着这些翻脸比翻书还快的粉丝，啧啧了一声。
en_us: Ye Li clucked her tongue against the roof of her tongue when she saw the drastic and rapid changes in the attitudes of the fans.

source: 叶漓看着，抓了抓头发：“莫名其妙！”
en_us: Looking at him, Ye Li scratched her hair and exclaimed, "Weirdo!"

source: 叶漓眼眶通红的看着三人关心的脸色，眨了眨眼睛，将泪意压了下去，“哥，我真没骗你们，我也不为难，之前我是因为于向阳一直没有拒绝我，所以以为他也对我有意思，才会一直追求他，可前几天情人节我找他的时候，他已经拒绝我了，还，还说我恶心，我又不是没有尊严的人，人家既然都拒绝我了，我也不可能纠缠不休，没了他，我嫁谁不是嫁？”
en_us: Looking at their concerned faces, Yu Xiangyang blinked and held her tears back."Brothers, I'm really not lying to you guys. I'm not feeling conflicted either. Previously, I thought that Yu Xiangyang liked me too because he did not reject me. That's why I kept pursuing him. However, when I looked for him on Valentine's Day a few days ago, he rejected me and said that I'm disgusting. Well, I have some dignity too. Since he has already rejected me, I can't possibly cling onto him and pester him continuously. Without him, I can still marry someone else."

source: 叶漓眼睛一眯。
en_us: Ye Li squinted.

source: 叶漓眼神一定，认真的看向了徐凤年，“我们领证好吗？”
en_us: Ye Li fixed her gaze on Xu Fengnian and looked at him solemnly. "Shall we register our marriage and get our marriage certificate?"

source: 叶漓睁开的眼睛，就对上了三张帅气到令人尖叫的俊脸。
en_us: As soon as Ye Li opened her eyes, she was greeted with three handsome and swoon-worthy faces.

source: 叶漓睡得却很香。
en_us: On the other hand, Ye Li had a good night's sleep.

source: 叶漓知道他公司很忙，点了点头：“好的哥哥。”
en_us: Knowing that he had matters to handle at the office, Ye Li nodded and said, "Yes, Brother."

source: 叶漓知道叶眉对徐凤年的心思。
en_us: Ye Li knew that Ye Mei carried a torch for Xu Fengnian.

source: 叶漓知道是自家三哥哥是因为昨天的事情去找于向阳麻烦了。
en_us: Ye Li knew that her third brother had gone to argue with Xiangyang because of what happened yesterday.

source: 叶漓知道，一旁的男人生气了。
en_us: Ye Li knew that the man beside her was infuriated.

source: 叶漓突然出现，她们原本还以为是叶眉认识的人，没有多想，可现在听她的话，怎么越听越奇怪呢。
en_us: When Ye Li suddenly appeared, they originally thought it was someone Ye Mei knew and did not think much about it, but after hearing Ye Li's words, they began to find it strange.

source: 叶漓突然就笑了，笑的很冷，“我是没什么能耐，就是知道老师你平时喜欢和咱们学校的主任小树林玩，您说，这算不算威胁呢？老师？”
en_us: Ye Li suddenly smiled coldly. "Indeed, I'm not capable. I only know that you usually like going to the woods to have some fun with the dean of our school. Is that considered a threat, Teacher?"

source: 叶漓笑了笑，感动的说：“等他们回来了，我一定好好说说他们，要是再这样对你，我就生气了。”
en_us: Ye Li smile and said as if she was touched, "When they come home, I'll definitely criticize them. If they treat you like that again, I'll really get angry."

source: 叶漓笑了：“二夫人客气了，这件事在网上闹的确实挺大，许多人都在带节奏，让您误会了也正常，但我相信，谣言止于智者。”
en_us: Ye Li smiled and said, "Madam, you're being polite. This matter has indeed caused a huge stir on the internet and many people have been blowing it up. It's normal that you'd get the wrong idea but I believe that rumors cease when they reach the ears of the wise."

source: 叶漓笑着回了一声，就将手机递给了叶枫。
en_us: Ye Li chuckled and handed her mobile phone to Ye Feng.

source: 叶漓笑着往后慵懒一靠，语气轻飘飘的，“哎呀，跟你开个玩笑而已，瞧把你吓得，不知道的别人还以为我欺负你了呢，司机叔叔您说是不是？”
en_us: Ye Li smiled and leaned backwards while saying in a nonchalant tone, "Ah, I was just joking. Look how scared you are. Those who do not know might think that I bullied you. Uncle, don't you agree?"

source: 叶漓缓了一会，舒服多了，不好意思的朝他笑了笑：“麻烦你了老公。”
en_us: After waiting for a while, Ye Li felt much more comfortable. She smiled at him embarrassedly and said, "Sorry to trouble you, Hubby."

source: 叶漓翻出一把剪刀，将自己厚重的头发修理了一下，感觉差不多之后，才扎起高高的马尾。
en_us: Ye Li whipped out a pair of scissors and gave her thick, heavy hair a trim. After being somewhat satisfied, she tied her hair back into a a high ponytail.

source: 叶漓胖，却胖的是大腿和脸。
en_us: Although Ye Li was chubby, her fats were mostly stored in her thighs and her face.

source: 叶漓脸一红，有些不好意思的看了徐凤年一眼，正好就对上了他盯着自己的目光，她一愣，赶忙收回了视线，也没拒绝，乖乖的坐了过去。
en_us: Blushing, Ye Li looked at Xu Fengnian embarrassedly and happened to make eye contact with him. After being stunned for a while, she hurriedly looked away and returned to her seat without rejecting.

source: 叶漓自然是高兴接受。
en_us: Ye Li naturally accepted her arrangements happily.

source: 叶漓莫名其妙的看她一眼：“我说我没邀请函了？”
en_us: Ye Li glanced at her in bewilderment and said, "Who said that I don't have an invitation card?"

source: 叶漓虽然很是不喜这两母女。
en_us: Ye Li detested Xu Yuan and her mother but she tried her best not to make her animosity obvious.

source: 叶漓被带去了办公室，这次不是班主任办公室，而是校长办公室。
en_us: Ye Li was brought to the office. This time, it was not the dean's office but the principal's office.

source: 叶漓解释道：“不是啦爸爸，是我要减肥，不关哥哥们的事。”
en_us: Ye Li explained, "No, Father, it has nothing to do with my brothers. I just want to lose some weight."

source: 叶漓走出教室，就被她拦住，只听叶眉一脸担忧的问：“阿漓姐姐，你没事吧，老师有没有为难你？”
en_us: Ye Li was stopped by her once she walked out of the classroom. Ye Li asked with a worried expression, "Sister Ye Li, are you alright? Did the teacher make things difficult for you?"

source: 叶漓赶忙喊了一声：“大哥哥，怎么了吗？”
en_us: Ye Li immediately exclaimed, "Ye Luo, what's wrong?"

source: 叶漓起身。
en_us: Ye Li stood up as she was told.

source: 叶漓跟在大夫人身后，她的身高没有大夫人高，整个人都被挡住了，这会儿听到老人的声音，连忙伸出脑袋。
en_us: Ye Li was following behind Mrs. Xu. Since she was much shorter than the latter, she was blocked by her. When she heard the old man's voice, she popped her head out.

source: 叶漓跟着大夫人刚走进，就接收了一众人的目光。
en_us: As soon as Ye Li entered with Mrs. Xu, all eyes were on her.

source: 叶漓蹙了蹙眉，心说你想跳舞关我屁事？
en_us: Ye Li frowned and thought to herself, 'What does that have to do with me?'

source: 叶漓蹙了蹙眉，虽然觉得有些诧异，但是现在她要去赴约，着实没有什么心情和这两人继续纠缠，于是冷冷的道：“没关系，我可以走了？”
en_us: Ye Li frowned. Although she was bewildered, she was in a rush to turn up for her date and she really wasn't in the mood to be embroiled in a scuffle with them. Hence, she asked coldly, "We're not related in any way. Can I leave now?"

source: 叶漓还真吃这一套：“不行啊，哥哥，不吃饭会得胃病的，爸爸呢，他在公司的话，你可以和爸爸一起去吃呀，等有时间，我来找你们一起去吃饭。”她关心的道。
en_us: Ye Li fell for it. "That can't do, Ye Luo, you'll develop gastric problems if you don't eat. Where's Father? If he's in the office, you can eat with him. I'll have a meal with you guys when I'm free someday," she said concernedly.

source: 叶漓这一次自杀醒来过来，好像是变了很多。
en_us: Ye Li seemed to have changed a lot after regaining consciousness from her suicide attempt.

source: 叶漓这样的怂包更别说了。
en_us: Ye Li, who used to be a wimp, was of course terrified of her in the past.

source: 叶漓这话一针见血。
en_us: Ye Li's words were straightforward and she had hit the nail on the head.

source: 叶漓这话分明就是在骂她！
en_us: Ye Li was obviously chastising her!

source: 叶漓这边没有回应，但是ys官方看到叶眉这推锅的话，顿时就怒了。
en_us: Ye Li did not respond but the authorities of YS Fashion immediately got enraged when they saw Ye Mei's statement where she was clearly pushing the blame to others.

source: 叶漓邪恶的想。
en_us: Ye Li thought to herself evilly.

source: 叶漓都有些不敢相信，为什么徐凤年那样优秀的男人，会愿意娶这样一无是处的自己，还..还睡得下去...
en_us: Ye Li could not believe why a brilliant man like Xu Fengnian would marry such a useless woman like her. He could even... he could even bring himself to get intimate with her...

source: 叶漓闻言，下意识看向一旁的徐凤年。
en_us: Hearing his words, Ye Li subconsciously looked at Xu Fengnian who was beside him.

source: 叶漓闻言，哭笑不得。
en_us: Hearing his words, Ye Li was caught between laughter and tears.

source: 叶漓闻言，心说我跟他不仅在一个学校，还在一个班呢？
en_us: Upon hearing her words, Ye Li thought to herself, 'He doesn't just go to the same college as me, we're in the same class too."

source: 叶漓闻言，抬眼扫了徐媛的方向一眼。
en_us: Upon hearing her words, Ye Li looked up at Xu Yuan and took a glance at her.

source: 叶漓闻言，挑了挑眉，又看了三哥哥发来的包场信息，笑了：“你确定？”
en_us: Upon hearing her words, Ye Li raised his brows before turning to look at the text that her brother, Ye Feng, had sent to inform her that he had booked the entire fish restaurant. She smiled and asked, "Are you sure?"

source: 叶漓闻言，眼神一动。
en_us: Upon hearing his words, Ye Li moved her eyes.

source: 叶漓闻言，笑了一声，没当一回事。
en_us: Hearing his words, Ye Li smiled and did not take it seriously.

source: 叶漓靠着墙，抬头看着不远处的校园景色。
en_us: Leaning against the wall, Ye Li looked up at the scenery of the campus that was not too far away.

source: 叶漓顺着他手的力道低下了头。
en_us: Ye Li lowered her head while he pressed his hand on it.

source: 叶漓：“比心心（jpj）”
en_us: Ye Li: "Heart.jpg"

source: 叶眉一下课，就站在了门口，等着叶漓。
en_us: As soon as they were dismissed from class, Ye Mei stood at the door to wait for Ye Li.

source: 叶眉一僵。
en_us: Ye Mei stiffened.

source: 叶眉一听这话，僵住了。
en_us: Ye Mei froze when she heard his words.

source: 叶眉一噎。
en_us: Ye Mei was at a loss for words.

source: 叶眉一拿出邀请函，接待的侍者顿时就变得严肃了起来。
en_us: Ye Mei took out an invitation card and the steward who received her immediately put on a stern expression.

source: 叶眉一滞，随后委委屈屈的低下了头：“不是那样的，姐姐你是不是因为这个才会不承认喜欢学长，这些称号都是同学们私下乱取的，我跟他没什么关系。”
en_us: Ye Mei paused for a while before lowering her head aggrievedly, "It's not like that. Sister, are you refusing to admit that you fancy Senior because of this? Those nicknames were casually made up by our schoolmates. There's nothing between me and him."

source: 叶眉一看，顿时眼睛一亮：“对的妈妈，就是这个！”
en_us: When Ye Mei saw the card, her eyes lit up and she exclaimed, "Yes, Mother, this is it!"

source: 叶眉一脸委屈的低下了头。
en_us: Ye Mei lowered her head with an aggrieved expression.

source: 叶眉一脸委屈的看她：“姐姐，你怎么能这样说，我知道你生我的气，你怎么对我发火都无所谓，但是可不可以不要殃及我的朋友，他们都是无辜的。”
en_us: Looking at her aggrievedly, Ye Mei said, "Ye Li, how can you say that? I know you're angry with me and it doesn't matter if you flare up at me but could you leave my friends out of this? They're all innocent."

source: 叶眉一脸委屈的说，那模样好似哥哥们又欺负她了一般。
en_us: Ye Mei was speaking aggrievedly, as if her brothers had bullied her again.

source: 叶眉一脸无奈：“你别这样说，毕竟她再怎么样也是我姐姐。”
en_us: With a helpless expression, Ye Mei said, "Don't say that. After all, she's my sister no matter what."

source: 叶眉不甘不愿的道：“今儿个我还听爸爸说，徐阿姨那边邀请叶漓过去，妈我也想去，你给我想个办法呀！”
en_us: Ye Li exclaimed grudgingly, "I even heard Father saying that the Mrs. Xu has invited Ye Li over to their place. Mother, I want to go too. Think of a solution for me!"

source: 叶眉之前为什么会一直提醒叶漓要将脸遮住，不是没有原因的。
en_us: There was a reason that Ye Mei repeatedly reminded Ye Li to hide her face previously.

source: 叶眉也一直吊着他，没有拒绝。
en_us: Ye Mei had been keeping him hanging and did not reject him.

source: 叶眉也不知道叶漓这是发什么疯，竟然会这样跟于向阳说话，这完全超出了她的预计范围，这会儿也是有点自乱阵脚。
en_us: Ye Mei did not know what was wrong with Ye Li at all. She did not expect Ye Li to say those things to Yu Xiangyang and at this moment, she felt like she had shot herself in the foot.

source: 叶眉也没心情再带那两个姐妹过来了，毕竟在她看来，他们的用处，就是嘲讽叶漓。
en_us: Ye Mei was not in the mood to bring her best friends along too. After all, she felt that their only purpose was for mocking Ye Li.

source: 叶眉亲自端着水果走了出来，放到了徐凤年面前，语气温温柔柔的，好听极了：“凤年哥哥，吃水果。”
en_us: Ye Mei walked out with some fruits and placed them in front of Xu Fengnian. She said in a warm, gentle and pleasant voice, "Brother Fengnian, have some fruit."

source: 叶眉什么时候受到过众人的质疑，一张俏脸气的都红了。
en_us: Since when had Ye Mei ever been doubted by the public? She was so enraged that her delicate face turned red.

source: 叶眉从没有此刻这么倒霉丢人过，一张脸雪白雪白的，难看极了。
en_us: Ye Mei had never felt so embarrassed before. She turned pale and sullen.

source: 叶眉他算不上喜欢，总给人一种带着面具见人的感觉，她绝对不像是表面那副无害那么简单。
en_us: He disliked Ye Mei because he felt that she often put on a pretentious facade and that she was definitely not as innocent and harmless as she seemed to be on the surface.

source: 叶眉以为她是要跟自己打招呼，赶忙上前两步，笑道：“二小姐，好久不见呀，还记得我？”
en_us: Thinking that she was going to greet her, Ye Mei hurried over and said smilingly, "Miss Xu Yuan, long time no see. Do you still remember me?"

source: 叶眉仿佛已经看到了当时的场景，心里一阵愉悦。
en_us: Ye Mei was filled with joy, as if she had already seen the scene that would take place later.

source: 叶眉低着头，乖巧应是。
en_us: Ye Mei lowered her head and assented obediently.

source: 叶眉僵住了。
en_us: Ye Mei froze.

source: 叶眉出生的时候，叶枫年纪还小，知道的事情没那么多，对叶眉虽然不是很喜欢，但是也不会去多想。
en_us: When Ye Mei was born, Ye Feng was still young and didn't know that much. Hence, he wouldn't think much about it even though he did not like her much.

source: 叶眉刚刚还委屈的脸顿时惨白。
en_us: With an aggrieved expression, Ye Mei immediately turned pale.

source: 叶眉刚要解释，背后就传来了管家的声音，“大少二少三少，于少爷来了。”
en_us: Ye Mei was just about to explain when the butler's voice sounded behind her. "Young Master, Second Young Master, Third Young Master, Young Master Yu is here."

source: 叶眉又是一愣，看向叶漓的眼中多了几分疑惑。
en_us: Once again, Ye Mei was stunned and she looked at Ye Li with bewilderment in her gaze.

source: 叶眉可能也没想到，自己明明是针对叶漓的话，却被ys看成了是针对他们而发。
en_us: Ye Mei probably never thought that YS Fashion would think that she was targeting them in her statement when she actually intended to direct the blame to Ye Li.

source: 叶眉听闻此言，以为是两家联姻一事，顿时忍不住开口道：“凤年哥哥，我知道我这样说你可能不会开心，但是为了姐姐的幸福，我不得不说，她已经有喜欢的人了，我希望你和哥哥不要再强迫她做不喜欢的事情。”
en_us: Hearing this, Ye Mei thought it was about the marriage between the two families, so she couldn't help but speak up, "Brother Fengnian, I know you might not be happy with me saying this, but for the sake of Sister's happiness, I have to tell you that she already likes someone else. I hope that you and my brothers won't won't force her to do something she doesn't like anymore."

source: 叶眉听闻这话，指甲陷入了肉中。
en_us: Upon hearing her words, Ye Mei clenched her fists, her fingernails digging into her flesh.

source: 叶眉和于向阳的计划，她势必要一步步的摧毁，让他们尝尝失去一切的滋味！
en_us: She would definitely destroy Ye Mei and Yu Xiangyang's plans, step by step, and make them get a taste of losing everything!

source: 叶眉和叶漓！
en_us: Ye Mei and Ye Li!

source: 叶眉咬了咬牙，赶忙跟了上去。
en_us: Ye Mei gritted her teeth and hurriedly caught up with them.

source: 叶眉啊叶眉，我回来了！
en_us: 'Ye Mei, Ye Mei, I'm back!'

source: 叶眉噎住。
en_us: Ye Mei choked.

source: 叶眉噎住了。
en_us: Ye Mei choked.

source: 叶眉回过神，赶忙摇头，勉强笑笑：“我不是这个意思，姐姐你别误会，我没关系的。”
en_us: Ye Mei recovered from the shock and hurriedly nodded. Forcing herself to smile, she explained, "That's not what I meant. Sister, don't be mistaken. I'm perfectly fine."

source: 叶眉在一旁又是庆幸，又是嫉妒，庆的是大家终于想开，但凡叶漓敢说出一句她不愿意嫁给徐凤年的话，那势必会得罪徐家，这辈子都不可能再嫁过去。
en_us: Standing at the side, Ye Mei was both glad and jealous. She was glad that they had finally figured it out and once Ye Family dared to say that she was not willing to marry Xu Fengnian, she would end up offending the Xu Family. She would then never be able to marry Xu Fengnian.

source: 叶眉她是很熟的，班上最优秀的女孩子。
en_us: She was very familiar with Ye Mei, the most outstanding girl in class.

source: 叶眉如何甘心。
en_us: How could Ye Mei be willing to accept that?

source: 叶眉委委屈屈的，一副被人冤枉的模样：“我真没有，我是你的妹妹，难道你还不相信吗？”
en_us: Looking as if she had been wronged, Ye Mei defended herself, "I really didn't. I'm your younger sister, do you still do not believe me?"

source: 叶眉将收好的论文交了上去。
en_us: Ye Mei handed in the papers that she had collected.

source: 叶眉张开的嘴就这样僵在了空气中。
en_us: Ye Mei's jaw dropped and stiffened.

source: 叶眉彻底笑不出来了。
en_us: Ye Mei couldn't laugh anymore.

source: 叶眉得到这个回应，心里也比较满意，笑道：“没关系的，你刚从国外回来，肯定有很多事情需要忙，以后咱们有的是时间一起玩。”
en_us: Pleased to get that response, Ye Mei smiled and said, "It's okay, you just came back from abroad. You must have a lot of things to do. We'll have plenty of time to hang out in the future."

source: 叶眉心中疑惑。
en_us: Ye Mei was filled with bewilderment.

source: 叶眉心里不甘。
en_us: Ye Mei was filled with indignation.
